tap "f/mcptools"
tap "powershell/tap"
brew "age"
brew "libyaml"
brew "python@3.13"
brew "azure-cli"
brew "bat"
brew "black"
brew "boost-python3"
brew "bpython"
brew "btop"
brew "colima"
brew "curl"
brew "cython"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "doctl"
brew "doppler"
brew "eza"
brew "fd"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "go"
brew "google-java-format"
brew "gopass"
brew "helix"
brew "htop"
brew "mole"
brew "nnn"
brew "node@22"
brew "powerlevel10k"
brew "python-build"
brew "python-gdbm@3.13"
brew "python-launcher"
brew "python-setuptools"
brew "python-tk@3.13"
brew "python@3.11"
brew "python@3.12"
brew "python@3.9"
brew "ripgrep"
brew "rustup"
brew "tag"
brew "typescript"
brew "uv"
brew "vercel-cli"
brew "f/mcptools/mcp"
cask "astro-editor"
cask "azure-data-studio"
cask "claude"
cask "git-credential-manager"
cask "tailscale"
cask "warp"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/dl/go1.23.9"
go "github.com/myitcv/gobin"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cargo-audit"
cargo "cargo-edit"
cargo "cargo-nextest"
cargo "cargo-tarpaulin"
cargo "cargo-update"
cargo "cargo-watch"
