tap "f/mcptools"
tap "powershell/tap"
brew "automake"
brew "awscli"
brew "libyaml"
brew "python@3.13"
brew "azure-cli"
brew "bat"
brew "cairo"
brew "openjdk"
brew "bfg"
brew "black"
brew "boost-python3"
brew "bpython"
brew "btop"
brew "ccache"
brew "cdrtools"
brew "pkgconf"
brew "chrome-cli"
brew "cling"
brew "cmake"
brew "colima"
brew "curl"
brew "cython"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "doctl"
brew "doppler"
brew "doxygen"
brew "eza"
brew "fd"
brew "fdupes"
brew "ffmpeg"
brew "fish"
brew "flake8"
brew "flowpipe"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "github-release"
brew "gitlab-ci-local"
brew "go"
brew "go-jsonnet"
brew "google-java-format"
brew "gopass"
brew "handbrake"
brew "htop"
brew "ipython"
brew "isort"
brew "jsonnet-bundler"
brew "jython"
brew "kubernetes-cli"
brew "libmagic"
brew "libopennet"
brew "llvm"
brew "macmon"
brew "marked"
brew "mole"
brew "movgrab"
brew "mypy"
brew "ne"
brew "nef"
brew "nest"
brew "networkit"
brew "newrelic-infra-agent"
brew "newt"
brew "ninja"
brew "nnn"
brew "node@22"
brew "ollama"
brew "onionprobe"
brew "tesseract"
brew "opencv"
brew "pdftilecut"
brew "pip-tools"
brew "pipx"
brew "poppler"
brew "postgresql@14"
brew "postgresql@15"
brew "powerlevel10k"
brew "pyenv"
brew "pytest"
brew "python-build"
brew "python-gdbm@3.13"
brew "python-launcher"
brew "python-setuptools"
brew "python-tk@3.13"
brew "python@3.11"
brew "python@3.12"
brew "python@3.9"
brew "ranger"
brew "ripgrep"
brew "rustup"
brew "syncthing"
brew "tag"
brew "tinyxml"
brew "typescript"
brew "uv"
brew "vercel-cli"
brew "watch"
brew "whisperkit-cli"
brew "wiki"
brew "f/mcptools/mcp"
cask "alacritty"
cask "android-commandlinetools"
cask "applite"
cask "astro-editor"
cask "azure-data-studio"
cask "backblaze"
cask "chrome-remote-desktop-host"
cask "claude"
cask "codex"
cask "dupeguru"
cask "fing"
cask "git-credential-manager"
cask "github"
cask "gitkraken-cli"
cask "istherenet"
cask "iterm2"
cask "kitty"
cask "micro-snitch"
cask "miniconda"
cask "network-radar"
cask "open-video-downloader"
cask "oxygen-xml-developer"
cask "piphero"
cask "preference-manager"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "rar"
cask "ray"
cask "rustdesk"
cask "timemachineeditor"
cask "tor-browser"
cask "tuple"
cask "warp"
cask "webviewscreensaver"
cask "youtube-downloader"
vscode "angular.ng-template"
vscode "anysphere.cursorpyright"
vscode "charliermarsh.ruff"
vscode "coderabbit.coderabbit-vscode"
vscode "continue.continue"
vscode "cstrap.flask-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "dongli.python-preview"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "fleshywaffles.vs-code-clippy"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "greptile.greptile-vscode"
vscode "hbenl.vscode-test-explorer"
vscode "idleberg.electron-builder"
vscode "jscearcy.rust-doc-viewer"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mark-tucker.aws-cli-configure"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "panicbit.cargo"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "serayuzgur.crates"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "xabikos.reactsnippets"
vscode "zerotaskx.rust-extension-pack"
vscode "zhangyue.rust-mod-generator"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/dl/go1.23.9"
go "github.com/myitcv/gobin"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cargo-audit"
cargo "cargo-edit"
cargo "cargo-nextest"
cargo "cargo-tarpaulin"
cargo "cargo-update"
cargo "cargo-watch"
cargo "firedbg-cli"
